In [15]:
import pandas as pd
import numpy as np
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [16]:
newdf=pd.DataFrame({'Name':["Jack","Lucy","Amy","Tony","Peter"],"No":[0,4,3,2,5]})
olddf=pd.DataFrame({'Name':["Jack","Lucy","Amy","Tony","Peter"],"No":[1,0,6,0,3]})
newdf
newdf.dtypes
olddf
olddf.dtypes

    Name  No
0   Jack   0
1   Lucy   4
2    Amy   3
3   Tony   2
4  Peter   5

Name    object
No       int64
dtype: object

    Name  No
0   Jack   1
1   Lucy   0
2    Amy   6
3   Tony   0
4  Peter   3

Name    object
No       int64
dtype: object

In [17]:
newdf=newdf[newdf['No']>0]
olddf=olddf[olddf['No']>0]
newdf
olddf

    Name  No
1   Lucy   4
2    Amy   3
3   Tony   2
4  Peter   5

    Name  No
0   Jack   1
2    Amy   6
4  Peter   3

In [18]:
told=olddf["Name"]
tnew=newdf["Name"]
adiff=np.isin(tnew,told)
adiff

array([False,  True, False,  True])

In [19]:
type(adiff)
adiff.size
if adiff.all() == False:
    print("There is newly added names")

numpy.ndarray

4

There is newly added names

In [20]:
newdf[adiff==False]

   Name  No
1  Lucy   4
3  Tony   2